FV2510/E_0208.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.1 | 11.12.2025 (urspr. 01.04.2025)
endfooter

title
WiM Strom

8.11.2: AD: Anfrage zur Rechnungsabwicklung des Messtellenbetriebes über den LF durch den LF



end title
:<b>E_0208</b>;
note right
<b><i>Prüfende Rolle: LF
end note

if (<b>10: </b> Lässt das Vertragsverhältnis mit dem Kunden das im Angebot benannte Beginndatum zum Messstellenbetrieb zu?) then (ja)
else (nein)
    :A01;
    note left
        Vertragsverhältnis mit Dritten lässt das Beginn-datum nicht zu.
    endnote
    kill;
endif
if (<b>20: </b> Handelt es sich um ein Angebot auf Basis eines Preisblattes?) then (ja)
    if (<b>40: </b> Liegt dem LF ein gültiges Preisblatt mit allen im Angebot angegebenen Preisschlüsselstämmen bzw. mit allen im Angebot angegebenen Artikel-ID vor?) then (ja)
    else (nein)
        :A02;
        note left
            Kein Preisblatt vorhanden
        endnote
        kill;
    endif
    if (<b>50: </b> Entsprechen die angebotenen Positionen dem Vertrags-verhältnis?) then (ja)
        :Bestellung versenden;
        kill;
    else (nein)
        :A03;
        note left
            Angebotspositionen abweichend zum Vertrags-verhältnis
        endnote
        kill;
    endif
else (nein)
endif
if (<b>50: </b> Entsprechen die angebotenen Positionen dem Vertrags-verhältnis?) then (ja)
    :Bestellung versenden;
    kill;
else (nein)
    :A03;
    note left
        Angebotspositionen abweichend zum Vertrags-verhältnis
    endnote
    kill;
endif

@enduml
